src/Enums/ВидыКонтроляТоваровОрганизаций/ВидыКонтроляТоваровОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтроляТоваровОрганизаций</name>
  <enumValues>
    <name>КонецМесяцаИДатаПоследнегоДвижения</name>
    <comment>Минимум остатка (на конец месяца; оперативный)</comment>
  </enumValues>
  <enumValues>
    <name>КонецДняКонецМесяцаИДатаПоследнегоДвижения</name>
    <comment>Минимум остатка (на конец дня; оперативный)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыКонтроляТоваровОрганизаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Расчет даты контроля товаров организаций по дате документа
Функция ДатаКонтроля(ДатаДокумента) Экспорт
	ВидКонтроля = Константы.ВидКонтроляТоваровОрганизаций.Получить();
	Если ВидКонтроля = Перечисления.ВидыКонтроляТоваровОрганизаций.КонецМесяцаИДатаПоследнегоДвижения Тогда
		ДатаГраницы = КонецМесяца(ДатаДокумента);
	ИначеЕсли ВидКонтроля = Перечисления.ВидыКонтроляТоваровОрганизаций.КонецДняКонецМесяцаИДатаПоследнегоДвижения Тогда
		ДатаГраницы = КонецДня(ДатаДокумента);
	Иначе
		ДатаГраницы = КонецМесяца(ДатаДокумента);
	КонецЕсли;
	Возврат ДатаГраницы;
КонецФункции

// Значение вида контроля товаров организаций по умолчанию
Функция ПоУмолчанию() Экспорт
	Возврат Перечисления.ВидыКонтроляТоваровОрганизаций.КонецМесяцаИДатаПоследнегоДвижения;
КонецФункции

#КонецОбласти

#КонецЕсли
